# IsAppropriateCategoryId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..IsAppropriateCategoryId Method
Family Class See Also
---
Identifies if the input category id can be assigned as the new category for this family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsAppropriateCategoryId(
	ElementId categoryId
)
```

Visual Basic
---
```text
Public Function IsAppropriateCategoryId ( _
	categoryId As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAppropriateCategoryId(
	ElementId^ categoryId
)
```

# ### Parameters
categoryId
    Type: Autodesk.Revit.DB..::..ElementId The category id.
# ### Return Value
True if the input category id can be assigned as the new category for this family, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Family Class
Autodesk.Revit.DB Namespace